# FailureMessageAccessor Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FailureMessageAccessor Properties
FailureMessageAccessor Class See Also
---
The FailureMessageAccessor type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace